# Material Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..Reference..::..Material Property
SpecTypeId..::..Reference Class See Also
---
Material, in discipline Common.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId Material { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Material As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Material {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId..::..Reference Class
Autodesk.Revit.DB Namespace